In [1]:
import pandas as pd

# Pandas data types

- DataFrames
- Series

In [2]:
df = pd.DataFrame({
    "Name" : ["Braund, Mr. Owen Harris",
              "Allen, Mr. William Henry",
              "Bonnell, Miss Elizabeth"
             ],
    "Age" : [22, 35, 58],
    "Sex" : ["male", "male", "female"]
})

In [3]:
df

                       Name  Age     Sex
0   Braund, Mr. Owen Harris   22    male
1  Allen, Mr. William Henry   35    male
2   Bonnell, Miss Elizabeth   58  female

Each column in a DataFrame object is a series.

In [4]:
df["Name"]

0     Braund, Mr. Owen Harris
1    Allen, Mr. William Henry
2     Bonnell, Miss Elizabeth
Name: Name, dtype: object

In [5]:
df["Age"]

0    22
1    35
2    58
Name: Age, dtype: int64

In [6]:
wealth = pd.Series([50000, 45000, 60000], name = "Wealth")

In [7]:
wealth

0    50000
1    45000
2    60000
Name: Wealth, dtype: int64

We can manipulate a DataFrame or Series by applying methods to them.

In [8]:
df["Age"].min()

22

In [10]:
wealth.max()

60000

In [11]:
df.describe()

             Age
count   3.000000
mean   38.333333
std    18.230012
min    22.000000
25%    28.500000
50%    35.000000
75%    46.500000
max    58.000000

# Reading and Writing Tabular Data